---
kind: other
id: Properties.T:Autodesk.Revit.DB.Architecture.TopographyEditScope
source: html/6247cfec-af52-3976-c683-edd90f875521.htm
---
# TopographyEditScope Properties

Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.